with not_epgu as 
	(select *, 
	"Всего записей" - "EПГУ" as "Записей не через ЕПГУ" 
	from test.fer),
	russia as (select 'Российская Федерация' as "Субъект РФ", sum("Всего записей") as "Всего записей", sum("EПГУ") as "EПГУ", sum("РПГУ") as "РПГУ", sum("Регистратура") as "Регистратура", sum("Инфомат") as "Инфомат", sum("Call center") as "Call center", sum("АРМ медработника") as "АРМ медработника", sum("Прочие") as "Прочие", sum("Записей не через ЕПГУ") as "Записей не через ЕПГУ"
		from not_epgu),
	new as (select * from russia
	union all select * from not_epgu),
	res as (
select *,
ROUND("Всего записей"/"Всего записей"::numeric*100, 2) as "%Всего записей",
ROUND("EПГУ"/"Всего записей"::numeric*100, 2) as "%EПГУ",
ROUND("РПГУ"/"Всего записей"::numeric*100, 2) as "%РПГУ",
ROUND("Регистратура"/"Всего записей"::numeric*100, 2) as "%Регистратура",
ROUND("Инфомат"/"Всего записей"::numeric*100, 2) as "%Инфомат",
ROUND("Call center"/"Всего записей"::numeric*100, 2) as "%Call center",
ROUND("АРМ медработника"/"Всего записей"::numeric*100, 2) as "%АРМ медработника",
ROUND("Прочие"/"Всего записей"::numeric*100, 2) as "%Прочие",
ROUND("Записей не через ЕПГУ"/"Всего записей"::numeric*100, 2) as "%Записей не через ЕПГУ"
from new)
SELECT
    "Субъект РФ",
    unnest(array['EПГУ', 'РПГУ', 'Регистратура', 'Инфомат', 'Call center', 'АРМ медработника', 'Прочие', 'Записей не через ЕПГУ', 'Всего записей']) AS "Вид обращения",
    unnest(array["EПГУ", "РПГУ", "Регистратура", "Инфомат", "Call center", "АРМ медработника", "Прочие", "Записей не через ЕПГУ", "Всего записей"]) AS "Количество записей",
    unnest(array["%EПГУ", "%РПГУ", "%Регистратура", "%Инфомат", "%Call center", "%АРМ медработника", "%Прочие", "%Записей не через ЕПГУ", "%Всего записей"]) AS "%"
FROM res;
